In [1]:
import numpy as np
import pandas as pd

In [2]:
train = pd.read_csv('./titanic_data/train.csv')
test = pd.read_csv('./titanic_data/test.csv')
gender_submission = pd.read_csv('./titanic_data/gender_submission.csv')

In [3]:
data = pd.concat([train, test], sort=False)

In [4]:
data['Sex'].replace(['male','female'], [0, 1], inplace=True)
data['Embarked'].fillna(('S'), inplace=True)
data['Embarked'] = data['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)
data['Fare'].fillna(np.mean(data['Fare']), inplace=True)

In [5]:
age_avg = data['Age'].mean()
age_std = data['Age'].std()

In [6]:
np.random.randint(age_avg - age_std, age_avg + age_std)

35

In [8]:
np.random.randint(age_avg - age_std, age_avg + age_std)

40

In [9]:
np.random.randint(age_avg - age_std, age_avg + age_std)

17

In [10]:
np.random.randint(age_avg - age_std, age_avg + age_std)

41

In [11]:
# 乱数のシードを固定してないと再現性が取れない

In [12]:
# ちなみに、このノートブックを引用している　→　https://www.kaggle.com/code/sishihara/upura-kaggle-tutorial-03-feature-engineering/notebook

In [13]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0

In [14]:
data.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              0
Cabin          1014
Embarked          0
dtype: int64

In [15]:
type(data)

pandas.core.frame.DataFrame

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   int64
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1309 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1309 non-null   int64
dtypes: float64(3), int64(6), object(3)
memory usage: 132.9+ KB

In [17]:
# 子供のほうが優先して救助されるかもしれない。しかし年齢列に欠損値が存在する。
# ひとまずデータの中央値で補完しておく

In [18]:
data['Age'].fillna(data['Age'].median(), inplace=True)

In [19]:
data.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age               0
SibSp             0
Parch             0
Ticket            0
Fare              0
Cabin          1014
Embarked          0
dtype: int64

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   int64
 5   Age          1309 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1309 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1309 non-null   int64
dtypes: float64(3), int64(6), object(3)
memory usage: 132.9+ KB

In [26]:
# 無事に補完された模様

In [27]:
# その他、現時点で関係なさそうなパラメータ（列）は削除

In [28]:
delete_columns = ['Name', 'PassengerId', 'SibSp', 'Parch', 'Ticket', 'Cabin']
data.drop(delete_columns, axis=1, inplace=True)

In [29]:
train = data[:len(train)]
test = data[len(train):]

In [30]:
train.head()

   Survived  Pclass  Sex   Age     Fare  Embarked
0       0.0       3    0  22.0   7.2500         0
1       1.0       1    1  38.0  71.2833         1
2       1.0       3    1  26.0   7.9250         0
3       1.0       1    1  35.0  53.1000         0
4       0.0       3    0  35.0   8.0500         0

In [33]:
y_train = train['Survived'] # 目的変数　訓練
X_train = train.drop('Survived', axis=1) # 説明変数　訓練

In [34]:
test.head()

   Survived  Pclass  Sex   Age     Fare  Embarked
0       NaN       3    0  34.5   7.8292         2
1       NaN       3    1  47.0   7.0000         0
2       NaN       2    0  62.0   9.6875         2
3       NaN       3    0  27.0   8.6625         0
4       NaN       3    1  22.0  12.2875         0

In [35]:
X_test = test.drop('Survived', axis=1) # 評価データ　説明変数

In [36]:
X_train.head()

   Pclass  Sex   Age     Fare  Embarked
0       3    0  22.0   7.2500         0
1       1    1  38.0  71.2833         1
2       3    1  26.0   7.9250         0
3       1    1  35.0  53.1000         0
4       3    0  35.0   8.0500         0

In [37]:
X_test.head()

   Pclass  Sex   Age     Fare  Embarked
0       3    0  34.5   7.8292         2
1       3    1  47.0   7.0000         0
2       2    0  62.0   9.6875         2
3       3    0  27.0   8.6625         0
4       3    1  22.0  12.2875         0

In [38]:
y_train.head()

0    0.0
1    1.0
2    1.0
3    1.0
4    0.0
Name: Survived, dtype: float64

In [39]:
# 機械学習アルゴリズム

In [40]:
# ここからは、feature_engineering.pyに記述